/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 Hardware_Profile.h
* 附属文件-Dependencies:  	 
* 文件描述-File Description:	 ( 头文件-Header File )
	■ 处理器"硬件配置文件" -头文件-Hardware specific definitions for Processor
	01) 处理器IO口使用宏定义，统一在Hardware_Profile.h 定义     
	02)      03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CSE  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CSE  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#ifndef __Hardware_Profile_H
#define __Hardware_Profile_H

#include <pic.h>       // "处理器"头文件: 内部寄存相关定义等

#include "Generic.h"	//常用程序编程规范、函数集 -头文件-Generic Type Definitions

#include "System.h"	 //"系统" 常用功能函数集-头文件

#include "MyProject.h"	//具体项目: 总功能程序-头文件

#include "Key.h"   //"IO 按键" -驱动程序(外部资源)-头文件




////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"宏定义**Module-specific macro**==============//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**单片机内部定义**================================//
#define	mEnable_GIE	(ei())  // 开启总中断GIE
#define	mDisable_GIE	(di())  // 关闭总中断GIE

#define	mNop	      		(NOP())    //空操作指令(用于"短延时"或"调试")

#define	mSleep	      		(SLEEP())   //使能MCU 进入休眠

//#define	mClose_WDT	(())  // 关闭看门狗
#define	mClr_WDTCNT     (CLRWDT()) // 清看门狗

#define	mReset_Soft    (RESET()) //软件复位


#define	FREQ_SYSTEM  	(8000000)		//系统运行频率 unit:Hz (倍频后，即最终的)

#define mDelay_us(x) 	_delay((unsigned long)((x)*(FREQ_SYSTEM/4000000.0))) // 死等待延时"x"个us //4条单指令=1个时钟周期=0.5us(当PIC单片机的CPU频率为8M)
#define mDelay_ms(x) 	_delay((unsigned long)((x)*(FREQ_SYSTEM/4000.0))) // 死等待延时"x"个ms






////////////////////////////////////////////////////////////////////////////
//==**单片机IO口使用宏定义,统一在HardwareProfile.h定义**===//


////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**内部"资源IO口使用宏定义**=======================//


 
////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**外部"资源IO口使用宏定义**=======================//



//--**P4.5  引脚: 单片机正常工作指示灯** ---------------------//
//#define WORKING_LED_DIR  (P4DIR)  
//#define WORKING_LED_PORT (P4OUT)
//#define WORKING_LED_IO   (BIT5)
   
	 //配置引脚为"输出",并"翻转"引脚输出状态
//#define mTurn_Working_Led  {WORKING_LED_DIR |= WORKING_LED_IO; WORKING_LED_PORT ^= WORKING_LED_IO;}              

	//配置引脚为"输出",并"点亮"工作指示灯
//#define mOpen_Working_Led  {WORKING_LED_DIR |= WORKING_LED_IO; WORKING_LED_PORT |= WORKING_LED_IO;}   

	//配置引脚为"输出",并"熄灭"工作指示灯
//#define mClose_Working_Led {WORKING_LED_DIR |= WORKING_LED_IO; WORKING_LED_PORT &= (~WORKING_LED_IO);} 


	////////////////////////////////////////////////////////////////////////////
	//==***IO按键**IO口使用宏定义**=========================//

//--**RA2 引脚:  Key_1 (IO 按键)** -------------------//
#define Key_DIR     (TRISA)  
#define Key_IN       (PORTA)

#define mSetIn_Key_1_IO   (TRISA2 = 1) //配置引脚为"输入"


////////////////////////////////////////////////////////////////////////////
//==**项目"专用"宏定义**Project-specific macro**================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**"函数"宏定义**Functions macro**=========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"函数声明**Exported Module-specific funcitions**====//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"外部" API 函数声明**Exported  API funcitions**===============//
////////////////////////////////////////////////////////////////////////////




#endif  /* __Hardware_Profile_H */






